; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=270, out_folder=./training, instance_id=50, seed=2074, goal_proportion=0.03

(define (problem blocksworld-50)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 b116 b117 b118 b119 b120 b121 b122 b123 b124 b125 b126 b127 b128 b129 b130 b131 b132 b133 b134 b135 b136 b137 b138 b139 b140 b141 b142 b143 b144 b145 b146 b147 b148 b149 b150 b151 b152 b153 b154 b155 b156 b157 b158 b159 b160 b161 b162 b163 b164 b165 b166 b167 b168 b169 b170 b171 b172 b173 b174 b175 b176 b177 b178 b179 b180 b181 b182 b183 b184 b185 b186 b187 b188 b189 b190 b191 b192 b193 b194 b195 b196 b197 b198 b199 b200 b201 b202 b203 b204 b205 b206 b207 b208 b209 b210 b211 b212 b213 b214 b215 b216 b217 b218 b219 b220 b221 b222 b223 b224 b225 b226 b227 b228 b229 b230 b231 b232 b233 b234 b235 b236 b237 b238 b239 b240 b241 b242 b243 b244 b245 b246 b247 b248 b249 b250 b251 b252 b253 b254 b255 b256 b257 b258 b259 b260 b261 b262 b263 b264 b265 b266 b267 b268 b269 b270 - object)
 (:init 
    (arm-empty)
    (clear b5)
    (on b5 b215)
    (on-table b215)
    (clear b217)
    (on b217 b52)
    (on-table b52)
    (clear b85)
    (on-table b85)
    (clear b235)
    (on b235 b219)
    (on b219 b36)
    (on b36 b117)
    (on-table b117)
    (clear b165)
    (on b165 b163)
    (on b163 b54)
    (on-table b54)
    (clear b164)
    (on b164 b7)
    (on b7 b141)
    (on b141 b221)
    (on b221 b191)
    (on b191 b106)
    (on b106 b94)
    (on b94 b102)
    (on b102 b66)
    (on-table b66)
    (clear b97)
    (on b97 b189)
    (on b189 b242)
    (on-table b242)
    (clear b198)
    (on b198 b82)
    (on b82 b103)
    (on b103 b169)
    (on b169 b12)
    (on b12 b178)
    (on-table b178)
    (clear b184)
    (on-table b184)
    (clear b83)
    (on b83 b128)
    (on b128 b99)
    (on b99 b240)
    (on b240 b249)
    (on b249 b188)
    (on-table b188)
    (clear b112)
    (on-table b112)
    (clear b196)
    (on b196 b38)
    (on-table b38)
    (clear b247)
    (on b247 b260)
    (on b260 b95)
    (on-table b95)
    (clear b92)
    (on b92 b14)
    (on b14 b44)
    (on-table b44)
    (clear b168)
    (on b168 b8)
    (on b8 b89)
    (on b89 b241)
    (on b241 b20)
    (on b20 b177)
    (on b177 b228)
    (on b228 b232)
    (on b232 b68)
    (on b68 b212)
    (on b212 b154)
    (on b154 b125)
    (on b125 b213)
    (on b213 b161)
    (on b161 b96)
    (on b96 b211)
    (on-table b211)
    (clear b27)
    (on b27 b174)
    (on-table b174)
    (clear b80)
    (on b80 b3)
    (on b3 b208)
    (on b208 b253)
    (on b253 b4)
    (on-table b4)
    (clear b264)
    (on b264 b262)
    (on b262 b243)
    (on-table b243)
    (clear b35)
    (on b35 b107)
    (on b107 b22)
    (on b22 b33)
    (on b33 b194)
    (on b194 b51)
    (on b51 b67)
    (on b67 b81)
    (on b81 b246)
    (on-table b246)
    (clear b251)
    (on b251 b105)
    (on-table b105)
    (clear b236)
    (on b236 b16)
    (on b16 b149)
    (on-table b149)
    (clear b98)
    (on b98 b25)
    (on b25 b192)
    (on b192 b72)
    (on b72 b39)
    (on b39 b239)
    (on b239 b258)
    (on b258 b181)
    (on b181 b37)
    (on b37 b214)
    (on b214 b71)
    (on-table b71)
    (clear b43)
    (on b43 b150)
    (on b150 b30)
    (on-table b30)
    (clear b53)
    (on b53 b60)
    (on b60 b100)
    (on-table b100)
    (clear b144)
    (on-table b144)
    (clear b90)
    (on b90 b166)
    (on b166 b202)
    (on b202 b176)
    (on b176 b201)
    (on b201 b133)
    (on-table b133)
    (clear b18)
    (on b18 b101)
    (on b101 b136)
    (on b136 b266)
    (on b266 b129)
    (on b129 b199)
    (on b199 b9)
    (on b9 b254)
    (on-table b254)
    (clear b57)
    (on b57 b77)
    (on b77 b76)
    (on b76 b224)
    (on b224 b110)
    (on-table b110)
    (clear b120)
    (on b120 b153)
    (on-table b153)
    (clear b88)
    (on b88 b209)
    (on-table b209)
    (clear b148)
    (on-table b148)
    (clear b204)
    (on b204 b116)
    (on b116 b152)
    (on-table b152)
    (clear b62)
    (on-table b62)
    (clear b234)
    (on b234 b222)
    (on b222 b113)
    (on b113 b172)
    (on b172 b145)
    (on b145 b252)
    (on b252 b70)
    (on b70 b223)
    (on-table b223)
    (clear b147)
    (on-table b147)
    (clear b244)
    (on b244 b267)
    (on-table b267)
    (clear b159)
    (on-table b159)
    (clear b270)
    (on b270 b121)
    (on b121 b195)
    (on b195 b131)
    (on b131 b225)
    (on b225 b10)
    (on b10 b6)
    (on-table b6)
    (clear b140)
    (on b140 b257)
    (on b257 b227)
    (on b227 b155)
    (on-table b155)
    (clear b46)
    (on b46 b139)
    (on b139 b58)
    (on-table b58)
    (clear b185)
    (on b185 b205)
    (on b205 b187)
    (on b187 b79)
    (on b79 b15)
    (on b15 b180)
    (on-table b180)
    (clear b34)
    (on-table b34)
    (clear b93)
    (on b93 b59)
    (on b59 b115)
    (on b115 b162)
    (on b162 b259)
    (on b259 b75)
    (on-table b75)
    (clear b171)
    (on b171 b2)
    (on b2 b28)
    (on b28 b55)
    (on-table b55)
    (clear b183)
    (on-table b183)
    (clear b45)
    (on b45 b248)
    (on b248 b127)
    (on-table b127)
    (clear b220)
    (on-table b220)
    (clear b268)
    (on b268 b19)
    (on b19 b203)
    (on b203 b109)
    (on-table b109)
    (clear b23)
    (on b23 b157)
    (on b157 b210)
    (on b210 b197)
    (on b197 b261)
    (on b261 b175)
    (on b175 b226)
    (on b226 b146)
    (on-table b146)
    (clear b17)
    (on b17 b122)
    (on b122 b182)
    (on b182 b56)
    (on b56 b123)
    (on b123 b190)
    (on b190 b74)
    (on-table b74)
    (clear b104)
    (on b104 b26)
    (on b26 b119)
    (on b119 b143)
    (on b143 b124)
    (on b124 b29)
    (on b29 b193)
    (on-table b193)
    (clear b64)
    (on b64 b130)
    (on-table b130)
    (clear b186)
    (on b186 b256)
    (on-table b256)
    (clear b61)
    (on b61 b156)
    (on b156 b231)
    (on b231 b138)
    (on b138 b218)
    (on-table b218)
    (clear b118)
    (on b118 b42)
    (on b42 b84)
    (on b84 b21)
    (on b21 b158)
    (on b158 b173)
    (on-table b173)
    (clear b170)
    (on-table b170)
    (clear b49)
    (on b49 b255)
    (on-table b255)
    (clear b73)
    (on b73 b229)
    (on b229 b132)
    (on-table b132)
    (clear b238)
    (on b238 b245)
    (on-table b245)
    (clear b69)
    (on b69 b63)
    (on-table b63)
    (clear b1)
    (on b1 b50)
    (on b50 b86)
    (on b86 b216)
    (on b216 b48)
    (on b48 b206)
    (on b206 b151)
    (on b151 b269)
    (on b269 b87)
    (on b87 b134)
    (on b134 b135)
    (on-table b135)
    (clear b200)
    (on b200 b250)
    (on b250 b230)
    (on-table b230)
    (clear b78)
    (on b78 b32)
    (on-table b32)
    (clear b108)
    (on b108 b167)
    (on b167 b237)
    (on b237 b31)
    (on b31 b91)
    (on b91 b265)
    (on b265 b40)
    (on-table b40)
    (clear b207)
    (on b207 b263)
    (on b263 b41)
    (on b41 b142)
    (on-table b142)
    (clear b160)
    (on b160 b47)
    (on b47 b233)
    (on b233 b11)
    (on b11 b111)
    (on b111 b65)
    (on b65 b13)
    (on b13 b179)
    (on-table b179)
    (clear b24)
    (on b24 b114)
    (on-table b114)
    (clear b126)
    (on b126 b137)
    (on-table b137))
 (:goal  (and 
    (clear b4)
    (on b4 b8)
    (on b8 b7)
    (on b7 b5)
    (on b5 b3)
    (on b3 b1)
    (on b1 b6)
    (on b6 b2)
    (on-table b2))))

; plan
1. (unstack b164 b7)
   deleted: (on b164 b7) (clear b164) (arm-empty)
   added: (holding b164) (clear b7)
   goals met: 0 of 9
2. (putdown b164)
   deleted: (holding b164)
   added: (clear b164) (arm-empty) (on-table b164)
   goals met: 0 of 9
3. (unstack b168 b8)
   deleted: (on b168 b8) (clear b168) (arm-empty)
   added: (holding b168) (clear b8)
   goals met: 0 of 9
4. (putdown b168)
   deleted: (holding b168)
   added: (clear b168) (arm-empty) (on-table b168)
   goals met: 0 of 9
5. (unstack b171 b2)
   deleted: (on b171 b2) (clear b171) (arm-empty)
   added: (holding b171) (clear b2)
   goals met: 0 of 9
6. (putdown b171)
   deleted: (holding b171)
   added: (clear b171) (arm-empty) (on-table b171)
   goals met: 0 of 9
7. (unstack b2 b28)
   deleted: (on b2 b28) (clear b2) (arm-empty)
   added: (holding b2) (clear b28)
   goals met: 0 of 9
8. (putdown b2)
   deleted: (holding b2)
   added: (clear b2) (arm-empty) (on-table b2)
   goals met: 1 of 9
9. (unstack b270 b121)
   deleted: (on b270 b121) (clear b270) (arm-empty)
   added: (holding b270) (clear b121)
   goals met: 1 of 9
10. (putdown b270)
   deleted: (holding b270)
   added: (clear b270) (arm-empty) (on-table b270)
   goals met: 1 of 9
11. (unstack b121 b195)
   deleted: (on b121 b195) (clear b121) (arm-empty)
   added: (holding b121) (clear b195)
   goals met: 1 of 9
12. (putdown b121)
   deleted: (holding b121)
   added: (clear b121) (arm-empty) (on-table b121)
   goals met: 1 of 9
13. (unstack b195 b131)
   deleted: (on b195 b131) (clear b195) (arm-empty)
   added: (holding b195) (clear b131)
   goals met: 1 of 9
14. (putdown b195)
   deleted: (holding b195)
   added: (clear b195) (arm-empty) (on-table b195)
   goals met: 1 of 9
15. (unstack b131 b225)
   deleted: (on b131 b225) (clear b131) (arm-empty)
   added: (holding b131) (clear b225)
   goals met: 1 of 9
16. (putdown b131)
   deleted: (holding b131)
   added: (clear b131) (arm-empty) (on-table b131)
   goals met: 1 of 9
17. (unstack b225 b10)
   deleted: (on b225 b10) (clear b225) (arm-empty)
   added: (holding b225) (clear b10)
   goals met: 1 of 9
18. (putdown b225)
   deleted: (holding b225)
   added: (clear b225) (arm-empty) (on-table b225)
   goals met: 1 of 9
19. (unstack b10 b6)
   deleted: (on b10 b6) (clear b10) (arm-empty)
   added: (holding b10) (clear b6)
   goals met: 1 of 9
20. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 1 of 9
21. (unstack b80 b3)
   deleted: (on b80 b3) (clear b80) (arm-empty)
   added: (holding b80) (clear b3)
   goals met: 1 of 9
22. (putdown b80)
   deleted: (holding b80)
   added: (clear b80) (arm-empty) (on-table b80)
   goals met: 1 of 9
23. (unstack b3 b208)
   deleted: (on b3 b208) (clear b3) (arm-empty)
   added: (holding b3) (clear b208)
   goals met: 1 of 9
24. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 1 of 9
25. (unstack b208 b253)
   deleted: (on b208 b253) (clear b208) (arm-empty)
   added: (holding b208) (clear b253)
   goals met: 1 of 9
26. (putdown b208)
   deleted: (holding b208)
   added: (clear b208) (arm-empty) (on-table b208)
   goals met: 1 of 9
27. (unstack b253 b4)
   deleted: (on b253 b4) (clear b253) (arm-empty)
   added: (holding b253) (clear b4)
   goals met: 2 of 9
28. (putdown b253)
   deleted: (holding b253)
   added: (clear b253) (arm-empty) (on-table b253)
   goals met: 2 of 9
29. (pickup b6)
   deleted: (clear b6) (on-table b6) (arm-empty)
   added: (holding b6)
   goals met: 2 of 9
30. (stack b6 b2)
   deleted: (clear b2) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b2)
   goals met: 3 of 9
31. (unstack b1 b50)
   deleted: (on b1 b50) (clear b1) (arm-empty)
   added: (holding b1) (clear b50)
   goals met: 3 of 9
32. (stack b1 b6)
   deleted: (clear b6) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b6)
   goals met: 4 of 9
33. (pickup b3)
   deleted: (clear b3) (on-table b3) (arm-empty)
   added: (holding b3)
   goals met: 4 of 9
34. (stack b3 b1)
   deleted: (clear b1) (holding b3)
   added: (arm-empty) (clear b3) (on b3 b1)
   goals met: 5 of 9
35. (unstack b5 b215)
   deleted: (on b5 b215) (clear b5) (arm-empty)
   added: (holding b5) (clear b215)
   goals met: 5 of 9
36. (stack b5 b3)
   deleted: (clear b3) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b3)
   goals met: 6 of 9
37. (unstack b7 b141)
   deleted: (on b7 b141) (clear b7) (arm-empty)
   added: (holding b7) (clear b141)
   goals met: 6 of 9
38. (stack b7 b5)
   deleted: (clear b5) (holding b7)
   added: (arm-empty) (clear b7) (on b7 b5)
   goals met: 7 of 9
39. (unstack b8 b89)
   deleted: (on b8 b89) (clear b8) (arm-empty)
   added: (holding b8) (clear b89)
   goals met: 7 of 9
40. (stack b8 b7)
   deleted: (clear b7) (holding b8)
   added: (arm-empty) (clear b8) (on b8 b7)
   goals met: 8 of 9
41. (pickup b4)
   deleted: (clear b4) (on-table b4) (arm-empty)
   added: (holding b4)
   goals met: 7 of 9
42. (stack b4 b8)
   deleted: (clear b8) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b8)
   goals met: 9 of 9
